Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/entitlement_to_health_services/entitlement_to_public_health_services.html.txt.tmx
Source language: en
Languages: ga

source: Entitlement to health services
ga: Teidlíocht do sheirbhísí sláinte

source: Entitlement to health services is primarily based on residency and means, rather than on your payment of tax or pay-related social insurance (PRSI)
ga: árachas sóisialta pá-choibhneasa (ÁSPC) a íoc

source: Any person, regardless of nationality, who is accepted by the Health Service Executive (HSE) as being ordinarily resident in Ireland has eligibility to health services
ga: Tá aon duine, is cuma cén náisiúntacht é/í, lena nglacann Feidhmeannacht na Seirbhíse Sláinte (HSE) mar dhuine ar a bhfuil gnáthchónaí in Éirinn, i dteideal teidlíocht ar sheirbhísí sláinte

source: You are ordinarily resident if you are living in Ireland and have lived here, or intend to live here, for at least one year
ga: Is ionann gnáthchónaitheoir agus duine a chónaíonn in Éirinn nó a raibh cónaí air nó uirthi in Éirinn nó a bhfuil sé beartaithe aige/aici cónaí in Éirinn, ar feadh bliana amháin ar a laghad

source: Depending on their circumstances, short-term visitors to Ireland may be entitled to health services that are free or subsidised
ga: D'fhéadfadh cuairteoirí gearrthéarmacha go hÉirinn a bheith i dteideal seirbhísí sláinte saor in aisce nó seirbhísí fóirdheontaithe i gcúinsí áirithe

source: There are two types of eligibility for people who are ordinarily resident:
ga: Tá dhá chineál incháilitheachta ann do dhaoine ar gnáthchónaitheoirí iad:

source: • Full eligibility for medical card holders
ga: • Incháilitheacht iomlán dóibh siúd a bhfuil cárta leighis acu

source: • Limited eligibility for people who don't have a medical card
ga: • Incháilitheacht theoranta do dhaoine nach bhfuil cárta leighis acu

source: If you have a medical card, you are entitled to:
ga: Má tá cárta leighis agat, tá tú i dteideal:

source: • Prescribed drugs and medicines, subject to a charge for each item prescribed
ga: • Drugaí agus cógais ar oideas, faoi réir táille in aghaidh na míre oidis

source: • Dental, optical and aural services
ga: • Seirbhísí fiaclóireachta, súl agus cluas

source: • Maternity and infant care services
ga: • Seirbhísí máithreachais agus cúraim naíonán

source: • Community care and personal social services
ga: • Seirbhísí cúraim phobail agus seirbhísí sóisialta pearsanta

source: If you do not have a medical card, you are entitled to free public hospital services but you may have to pay in-patient and out-patient hospital charges
ga: Muna bhfuil cárta leighis agat, tá tú i dteideal seirbhísí ospidéil phoiblí saor in aisce ach b'fhéidir go mbeidh ort táillí ospidéil do sheirbhísí othair chónaithigh agus eisothair a íoc

source: You are also entitled to subsidised prescribed drugs and medicines and maternity and infant care services
ga: Tá tú i dteideal drugaí agus míochaine ar oideas freisin chomh maith le seirbhísí máithreachais agus cúraim naíonán

source: Unless you hold a GP visit card, you are not entitled to free GP services
ga: Mura bhfuil Cárta Cuairte GP níl tú i dteideal seirbhísí GP saor in aisce

source: There are certain general health services that are available to people on the basis of their need or health status rather than on whether they have a medical card or not
ga: Tá roinnt seirbhísí ar fáil do dhaoine de réir an riachtanais nó an stádais sláinte atá acu, is cuma má tá cárta leighis acu nó mura bhfuil

source: • People who qualify for the Long Term Illness Scheme are entitled to get the drugs and medicines for the treatment of that illness free of charge
ga: • Tá daoine atá incháilithe don Scéim Breoiteachta Fadtréimhsí i dteideal drugaí agus cógais a fháil saor in aisce chun an galar sin a chóireáil

source: • Child health services are available to all children
ga: • Tá seirbhísí sláinte leanaí ar fáil do gach leanbh

source: • People who have contracted Hepatitis C through blood transfusion and have a Health Amendment Act Card
ga: • Daoine a tholg Heipitíteas C trí fhuilaistriú agus agus a bhfuil Cárta faoin Acht um Leasú Sláinte acu

source: If you are coming to live in Ireland or returning here to live, you must satisfy the Health Service Executive (HSE) that you are "ordinarily resident" – that you are living in Ireland and intend to live here for at least one year
ga: Má tá tú ag teacht chun cónaí in Éirinn nó ag filleadh anseo chun cónaí ann, ní mór duit a chruthú d’Fheidhmeannacht na Seirbhíse Sláinte (HSE) go bhfuil “gnáthchónaí” ort anseo – go bhfuil tú i do chónaí in Éirinn agus go bhfuil sé beartaithe agat cónaí anseo ar feadh bliana ar a laghad

source: To establish that a person is ordinarily resident the HSE may require:
ga: D’fhéadfadh sé go mbeadh an méid seo a leanas ag teastáil ón HSE chun a chruthú go bhfuil gnáthchónaí ar dhuine:

source: • Proof of property purchase or rental, including evidence that the property in question is the person's principal residence
ga: • Cruthúnas go bhfuil maoin ceannaithe nó tógtha ar cíos, lena n-áirítear cruthúnas gurb í an mhaoin seo príomháit chónaithe an duine

source: • Evidence of transfer of funds, bank accounts, pensions etc
ga: • Fianaise gur aistríodh airgead, cuntais bainc, pinsin srl

source: • A residence permit or visa
ga: • Víosa nó cead cónaithe

source: • A work permit or visa, statements from employers etc
ga: • Víosa nó cead oibre, ráitis ó fhostóirí srl

source: • In some instances, the signing of an affidavit (a sworn written statement) by the applicant
ga: • I gcásanna áirithe, beidh ar an iarratasóir mionnscríbhinn (ráiteas scríofa faoi mhionn) a shíniú

source: Any person, regardless of nationality, who is accepted by the HSE as being ordinarily resident in Ireland is entitled to either full eligibility (Category 1, i.e
ga: Tá aon duine, is cuma cén náisiúntacht é/í, lena nglacann an HSE mar dhuine ar a bhfuil gnáthchónaí in Éirinn, i dteideal incháilitheacht iomlán (Catagóir 1, m.sh

source: medical card holders) or limited eligibility (Category 2) for health services
ga: daoine a bhfuil cártaí leighis acu) nó incháilitheacht theoranta (Catagóir 2) ar sheirbhísí sláinte

source: The fact that a non-EU national has established their eligibility for health services does not automatically mean that their dependants are also eligible
ga: Díreach mar gheall go bhfuil náisiúnach nach as an AE dó/di tar éis a (h)incháilitheacht maidir le seirbhísí sláinte a chruthú ní hé sin le rá go bhfuil a gcleithiúnaithe incháilithe freisin

source: Dependants of non-EU nationals may also have to satisfy the above requirements
ga: D’fhéadfadh sé go mbeadh ar chleithiúnaithe náisiúnach nach as an AE dóibh na riachtanais thuas a shásamh freisin

source: You may qualify for a medical card under EU rules if you are ordinarily resident in Ireland and you are getting a social security pension from another EU/EEA country or Switzerland, or if you are working and paying social insurance in one of these countries
ga: Faoi rialacha an AE, má tá gnáthchónaí ort in Éirinn agus tú ag fáil pinsean slándála sóisialaí ó thír eile san AE/LEE nó ón Eilvéis,nó má tá tú ag obair agus ag íoc árachais shóisialta i gceann de na tíortha sin, d’fhéadfá a bheith i dteideal cárta leighis

source: You must not be subject to Irish social security legislation
ga: Ní mór nach mbeifeá faoi réir reachtaíocht slándála sóisialta in Éirinn

source: This means that you must not be in receipt of a contributory Irish social welfare payment or be working in Ireland and be liable to pay PRSI
ga: Ciallaíonn sé sin nár chóir duit a bheith ag fáil íocaíocht leasa shóisialaigh in Éirinn nó ag obair in Éirinn agus faoi dhliteanas ÁSPC a íoc

source: If you are living in Ireland and you are the dependant of a pensioner entitled under EU Regulations, or are the dependant of a person who is working in another country covered by the Regulations, you may be eligible for a medical card
ga: Má tá cónaí ort in Éirinn agus más cleithiúnach pinsinéara atá i dteideal faoi Rialacháin an AE tú, nó más cleithiúnach duine atá ag obair i dtír eile agus clúdaithe ag na Rialacháin tú, d’fhéadfá a bheith i dteideal chárta leighis

source: You must not be subject to Irish social security legislation (in the case of child dependants this rule applies to the spouse or person looking after them)
ga: Ní féidir leat a bheith faoi réir reachtaíocht slándála sóisialta in Éirinn (i gcás cleithiúnaithe linbh tá feidhm ag an riail seo maidir leis an gcéile nó an duine atá ag tabhairt aire dóibh)

source: Posted workers and their dependants may also qualify for the medical card
ga: D’fhéadfadh oibrithe sannta agus a gcleithiúnaithe a bheith incháilithe do chárta leighis chomh maith

source: These are workers who are employed in another country covered by the regulations but are sent by their employers to work in Ireland for a limited time
ga: Tá na hoibrithe sin fostaithe i dtír eile atá clúdaithe ag na rialacháin ach atá seolta ag a bhfostóirí ó Éirinn le dul ag obair ar feadh tréimhse teoranta

source: See the medical card assessment guidelines (pdf) for more information about entitlement under EU Regulations
ga: Féach na treoirlínte maidir le measúnú chárta leighis (pdf) chun tuilleadh eolais a fháil i ndáil le teidlíocht faoi Rialacháin an AE
